Revit 2027 API
ParameterTypeId.PlumbingFixturesTrap Property
 "Trap"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesTrap { get; }
Public Shared ReadOnly Property PlumbingFixturesTrap As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesTrap {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesTrap : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace